Data Transformation

In [4]:
import pandas as pd

In [5]:
df = pd.read_csv("data.csv")

In [6]:
df

      Name   School  Marks
0   Aniket       kv     78
1     Alek       st     84
2     Ashu      hub     59
3  Chandan   stmary     45
4      Dev  stpeter     78
5     Abhi     sans     98
6      Ani     audi     63
7     Udit     aghi     55

In [7]:
df.sort_values("Marks")

      Name   School  Marks
3  Chandan   stmary     45
7     Udit     aghi     55
2     Ashu      hub     59
6      Ani     audi     63
4      Dev  stpeter     78
0   Aniket       kv     78
1     Alek       st     84
5     Abhi     sans     98

In [8]:
df.sort_values("Marks", ascending=False)

      Name   School  Marks
5     Abhi     sans     98
1     Alek       st     84
4      Dev  stpeter     78
0   Aniket       kv     78
6      Ani     audi     63
2     Ashu      hub     59
7     Udit     aghi     55
3  Chandan   stmary     45

In [11]:
df["Rank"] = df["Marks"].rank(method="dense")

In [12]:
df

      Name   School  Marks  Rank
0   Aniket       kv     78   5.0
1     Alek       st     84   6.0
2     Ashu      hub     59   3.0
3  Chandan   stmary     45   1.0
4      Dev  stpeter     78   5.0
5     Abhi     sans     98   7.0
6      Ani     audi     63   4.0
7     Udit     aghi     55   2.0